# class NumberToWord:
#     def __init__(self):
#         self.number_list = ['एक', 'दुइ', 'तीन', 'चार', 'पाँच', 'छ', 'सात', 'आठ', 'नौ', 'दश', 'एघार', 'बाह्र', 'तेर', 'चौध',
#                             'पन्ध्र', 'सोर्ह', 'सत्र', 'अठार', 'उन्नाइस', 'बीस', 'एक्काइस', 'बाईस', 'तेइस', 'चौबिस', 'पच्चीस',
#                             'छब्बीस', 'सत्ताइस', 'अठ्ठाइस', 'उन्नतीस', 'तीस', 'एकतीस', 'बत्तीस', 'तेत्तीस', 'चौतीस', 'पैतिस',
#                             'छत्तिस', 'सड्तीस', 'अड्तीस', 'उन्नचालीस', 'चालीस', 'एकचालीस', 'ब्यालीस', 'त्रीचालीस', 'चौबालीस',
#                             'पैतालीस', 'छ्यालीस', 'सड्चालीट्ठ', 'अड्चालीस', 'उन्नपचास', 'पचास', 'एकाउन्न', 'बाउन्न', 'त्रीपन्न',
#                             'चौबन्न', 'पचपन्न', 'छप्पन्न', 'सन्ताउन्न', 'अन्ठाउन्न', 'उनन्साठ्ठी', 'साठी', 'एकसाठी', 'बयासठ्ठी',
#                             'त्रीसठ्ठी', 'चौसठ्ठी', 'पैसठ्ठी', 'छ्यासठ्ठी', 'सड्सठ्ठी', 'अठ्सठ्ठी', 'उन्नसत्तरी', 'सत्तरी',
#                             'एकत्तर', 'बहत्तर', 'त्रीयत्तर', 'चौरत्तर', 'पचत्तर', 'छ्यात्तर', 'सत्तर', 'अठाअार', 'उन्नअसी',
#                             'असी', 'एकासी', 'बयासी', 'त्रीरासी', 'चौरासी', 'पचासी', 'छ्यासी', 'सतासी', 'अठासी', 'उनानब्बे', 'नब्बे',
#                             'एकानब्बे', 'बयानब्बे', 'त्रीयानब्बे', 'चौरानब्बे', 'पञ्चानब्बे', 'छ्यानब्बे', 'सन्तानब्बे', 'अन्ठानब्बे',
#                             'उनान्सय']

#         self.main_list = {'100000000000': 'खरव', '1000000000': 'अरव', '10000000': 'करोड', '100000': 'लाख', '1000': 'हजार',
#                           '100': 'सय'}

#     def check_valid_number(self, nums):
#         if nums > 9900000000000 or not isinstance(nums, int):
#             raise Exception("गणकले गन्न सक्ने भन्दा बढी नम्बर हाल्नुभो")

#     def ten(self, nums):
#         if nums > 0:
#             return self.number_list[nums - 1]
#         else:
#             return ''

#     def nepali_name(self, nums, divisor):
#         number = nums // divisor
#         if number > 0:
#             return f"{self.number_list[number - 1]} {self.main_list[str(divisor)]}"
#         else:
#             return ''

#     def nepali_word(self, nums):
#         nums = abs(nums)
#         self.check_valid_number(nums)
#         result = ''
#         for count, name in self.main_list.items():
#             result = self.nepali_name(nums, int(count))
#             if result != '':
#                 return result

#         return result


# # Let's convert a number to a Nepali word
# number_word = NumberToWord()
# print(number_word.nepali_word(30987))
class NumberToWord:
    def __init__(self):
        self.number_list = ['एक', 'दुइ', 'तीन', 'चार', 'पाँच', 'छ', 'सात', 'आठ', 'नौ', 'दश', 'एघार', 'बाह्र', 'तेर', 'चौध',
                            'पन्ध्र', 'सोर्ह', 'सत्र', 'अठार', 'उन्नाइस', 'बीस', 'एक्काइस', 'बाईस', 'तेइस', 'चौबिस', 'पच्चीस',
                            'छब्बीस', 'सत्ताइस', 'अठ्ठाइस', 'उन्नतीस', 'तीस', 'एकतीस', 'बत्तीस', 'तेत्तीस', 'चौतीस', 'पैतिस',
                            'छत्तिस', 'सड्तीस', 'अड्तीस', 'उन्नचालीस', 'चालीस', 'एकचालीस', 'ब्यालीस', 'त्रीचालीस', 'चौबालीस',
                            'पैतालीस', 'छ्यालीस', 'सड्चालीट्ठ', 'अड्चालीस', 'उन्नपचास', 'पचास', 'एकाउन्न', 'बाउन्न', 'त्रीपन्न',
                            'चौबन्न', 'पचपन्न', 'छप्पन्न', 'सन्ताउन्न', 'अन्ठाउन्न', 'उनन्साठ्ठी', 'साठी', 'एकसाठी', 'बयासठ्ठी',
                            'त्रीसठ्ठी', 'चौसठ्ठी', 'पैसठ्ठी', 'छ्यासठ्ठी', 'सड्सठ्ठी', 'अठ्सठ्ठी', 'उन्नसत्तरी', 'सत्तरी',
                            'एकत्तर', 'बहत्तर', 'त्रीयत्तर', 'चौरत्तर', 'पचत्तर', 'छ्यात्तर', 'सत्तर', 'अठाअार', 'उन्नअसी',
                            'असी', 'एकासी', 'बयासी', 'त्रीरासी', 'चौरासी', 'पचासी', 'छ्यासी', 'सतासी', 'अठासी', 'उनानब्बे', 'नब्बे',
                            'एकानब्बे', 'बयानब्बे', 'त्रीयानब्बे', 'चौरानब्बे', 'पञ्चानब्बे', 'छ्यानब्बे', 'सन्तानब्बे', 'अन्ठानब्बे',
                            'उनान्सय']
        self.main_list = {'100000000000': 'खरव', '1000000000': 'अरव', '10000000': 'करोड', '100000': 'लाख', '1000': 'हजार',
                          '100': 'सय'}

    def check_valid_number(self, nums):
        if nums > 9900000000000 or not isinstance(nums, int):
            raise Exception("गणकले गन्न सक्ने भन्दा बढी नम्बर हाल्नुभो")

    def ten(self, nums):
        if nums > 0:
            return self.number_list[nums - 1]
        else:
            return ''

    def nepali_name(self, nums, divisor):
        number = nums // divisor
        if number > 0:
            return f"{self.number_list[number - 1]}"
        else:
            return ''

    def nepali_word(self, nums):
        nums = abs(nums)
        self.check_valid_number(nums)
        result = ''
        for count, name in self.main_list.items():
            result += self.nepali_name(nums, int(count))
            if result != '':
                break

        return result


# Let's convert a number to a Nepali word
number_word = NumberToWord()
print(number_word.nepali_word(233))

